diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаДанных</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

diplom-src/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

diplom-src/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ObjectModule.bsl
Процедура СоздатьДокументыРеализацияВФоне(Параметры, АдресРезультата) Экспорт
	
	Результат = СоздатьДокументыРеализация(Параметры, АдресРезультата);
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

Функция СоздатьДокументыРеализация(Параметры, АдресРезультата)
	
	Номенклатура = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	Таблица.Колонки.Добавить("Документ", Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Дата КАК Дата,
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	|	ДоговорыКонтрагентов.Организация КАК Организация,
	|	&Номенклатура КАК Номенклатура,
	|	ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты КАК Цена,
	|	ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты КАК Сумма,
	|	1 КАК Количество
	|ПОМЕСТИТЬ ВТ_Договора
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|	И ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора >= &НачалоПериода
	|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора <= &КонецПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Договор КАК Договор
	|ПОМЕСТИТЬ ВТ_Документы
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	|	И РеализацияТоваровУслуг.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_Договора.Организация КАК Организация
	|			ИЗ
	|				ВТ_Договора КАК ВТ_Договора)
	|	И РеализацияТоваровУслуг.Контрагент В
	|			(ВЫБРАТЬ
	|				ВТ_Договора.Контрагент КАК Контрагент
	|			ИЗ
	|				ВТ_Договора КАК ВТ_Договора)
	|	И РеализацияТоваровУслуг.Договор В
	|			(ВЫБРАТЬ
	|				ВТ_Договора.Договор КАК Договор
	|			ИЗ
	|				ВТ_Договора КАК ВТ_Договора)
	|	И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериодаДокумента И &КонецПериодаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Договора.Дата КАК Дата,
	|	ВТ_Договора.Договор КАК Договор,
	|	ВТ_Договора.Контрагент КАК Контрагент,
	|	ВТ_Договора.Организация КАК Организация,
	|	ВТ_Договора.Номенклатура КАК Номенклатура,
	|	ВТ_Договора.Цена КАК Цена,
	|	ВТ_Договора.Сумма КАК Сумма,
	|	ВТ_Договора.Количество КАК Количество,
	|	ЕСТЬNULL(ВТ_Документы.Ссылка, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК Ссылка
	|ИЗ
	|	ВТ_Договора КАК ВТ_Договора
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Документы КАК ВТ_Документы
	|		ПО ВТ_Договора.Договор = ВТ_Документы.Договор";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Параметры.Период));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Параметры.Период));
	Запрос.УстановитьПараметр("НачалоПериодаДокумента", НачалоМесяца(Параметры.ТекущаяДата));
	Запрос.УстановитьПараметр("КонецПериодаДокумента", КонецМесяца(Параметры.ТекущаяДата));
	Запрос.УстановитьПараметр("Дата", Параметры.ТекущаяДата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Ссылка <> Документы.РеализацияТоваровУслуг.ПустаяСсылка() Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		НовыйДокумент.Заполнить(Выборка);
		НовыйДокумент.ПроверитьЗаполнение(); 
		
		Попытка
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.Договор = Выборка.Договор; 
		НоваяСтрока.Документ = НовыйДокумент.Ссылка; 
		
	КонецЦикла; 
	
	Возврат Таблица;
	
КонецФункции
